In [1]:
import pandas as pd
import numpy as np

In [2]:
test_data = pd.read_csv('titanic_test.csv')
train_data = pd.read_csv('titanic_train.csv')

In [3]:
test_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [4]:
train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
train_labels =train_data['Survived']
train_data.drop(['Survived','Name','Ticket','PassengerId','Cabin'], axis = 1, inplace = True)

In [9]:
train_data

     Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         3    male  22.0      1      0   7.2500        S
1         1  female  38.0      1      0  71.2833        C
2         3  female  26.0      0      0   7.9250        S
3         1  female  35.0      1      0  53.1000        S
4         3    male  35.0      0      0   8.0500        S
..      ...     ...   ...    ...    ...      ...      ...
886       2    male  27.0      0      0  13.0000        S
887       1  female  19.0      0      0  30.0000        S
888       3  female   NaN      1      2  23.4500        S
889       1    male  26.0      0      0  30.0000        C
890       3    male  32.0      0      0   7.7500        Q

[891 rows x 7 columns]

In [ ]:
**MAPPING ALL CATEGORICAL DATA FEATURES TO NUMERICAL VALUES**

In [10]:
train_data['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [11]:
train_data['Sex'].unique()

array(['male', 'female'], dtype=object)

In [14]:
train_data['Sex']= train_data.Sex.map({'male': 1, 'female': 0})
train_data['Embarked']= train_data.Embarked.map({'S': 0, 'C':1,'Q': 2})

In [15]:
train_data

     Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0         3    1  22.0      1      0   7.2500       0.0
1         1    0  38.0      1      0  71.2833       1.0
2         3    0  26.0      0      0   7.9250       0.0
3         1    0  35.0      1      0  53.1000       0.0
4         3    1  35.0      0      0   8.0500       0.0
..      ...  ...   ...    ...    ...      ...       ...
886       2    1  27.0      0      0  13.0000       0.0
887       1    0  19.0      0      0  30.0000       0.0
888       3    0   NaN      1      2  23.4500       0.0
889       1    1  26.0      0      0  30.0000       1.0
890       3    1  32.0      0      0   7.7500       2.0

[891 rows x 7 columns]

**REPALCING THE MISSING DATASET IN THE COLUMS WITH THE MEDIAN OF EACH COLUMN**

In [21]:
train_data.isnull().sum()

Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
dtype: int64

In [22]:
train_data['Age'] = train_data['Age'].fillna(train_data['Age'].median())
train_data['Embarked'] = train_data['Embarked'].fillna(train_data['Embarked'].median())

**SPLITTING TRAIN DATASET INTO TESTING AND TRAINING DATASET**

In [28]:
from sklearn.model_selection import train_test_split
trainData, valData, trainLabels, valLabels = (train_test_split(train_data, train_labels, train_size=0.76))

** USING THE DECISION TREE ALGORITHM**

In [24]:
from sklearn import tree

In [30]:
decision_tree =tree.DecisionTreeClassifier(max_depth=3)
model= decision_tree.fit(trainData,trainLabels)

accuracy = model.score(valData, valLabels)* 100
accuracy

78.03738317757009

**this model has a 78 percent prediction accuracy**

** USING THE MODEL ON THE TEST DATA**